/*
Task_2
На первой строке записывается натуральное число n - количество строчек в книге. Затем вводится n строк - строки книги. 
потом вводится натуральное число m - количество продуктов, на которые у человека аллергия. 
Потом вводится m строк - вида "продукт1 - продукт2", где продукт1 - продукт, на который у человека аллергия и продукт2 - продукт, 
на который следует заменить продукт1. Гарантируется что любой продукт состоит из 1 слова. название продуктов написаны строчными буквами. 
Гарантируется, что продукты, на которые нужно выполнить замену, не встречаются изначально в тексте.
Выходные данные
Замените все продукты в поваренной книге Васи и выведите их построчно на экран. На окончания не обращайте внимание. 
ВАЖНО!!! Если продукт, который следует заменить написан с большой буквы, то и замена тоже должна начинаться с большой буквы!
Sample Input:
2
Рецепт 1. Арахис 100гр, мороженое 200гр. Возьмите арахис и измелчите его. Посыпьте измельчённый арахис на мороженое.
Рецепт 2. Клубника 100гр, сгущенка 3кг. Смешать, есть) Радоваться жизни.
3
арахис - колбаса
клубника - вишня
сгущенка - молоко
Sample Output:
Рецепт 1. Колбаса 100гр, мороженое 200гр. Возьмите колбаса и измелчите его. Посыпьте измельчённый колбаса на мороженое.
Рецепт 2. Вишня 100гр, молоко 3кг. Смешать, есть) Радоваться жизни.*/

package Home_Work_2;

import java.util.HashMap;

public class task_3 {
    public static void main(String[] args) {
        String[] arrBook = {
                "Рецепт 1. Арахис 100гр, мороженое 200гр. Возьмите арахис и измельчите его. Посыпьте измельчённый арахис на мороженое.",
                "Рецепт 2. Клубника 100гр, сгущенка 3кг. Смешать, есть) Радоваться жизни." };
        String[] arrChange = { "арахис - колбаса", "клубника - вишня", "сгущенка - молоко" };

        HashMap<String, String> map = new HashMap<String, String>();

        for (int i = 0; i < arrChange.length; i++) {
            String[] arr = arrChange[i].split(" - ");
            map.put(arr[0], arr[1]);
        }

        for (String string : arrBook) {
            String arrBookStr = string;
            String[] arrBookStrArr = arrBookStr.split(" ");
            for (int i = 0; i < arrBookStrArr.length; i++) {
                if (map.containsKey(arrBookStrArr[i].toLowerCase())) {
                    String str = map.get(arrBookStrArr[i].toLowerCase());
                    if (arrBookStrArr[i] != arrBookStrArr[i].toLowerCase()) {
                        str = str.substring(0, 1).toUpperCase() + str.substring(1);
                    }
                    arrBookStrArr[i] = str;
                }
            }
            String str = String.join(" ", arrBookStrArr);
            System.out.println(str);
        }
    }
}